ЛИС2/src/Catalogs/ВыпускиВВоду/ВыпускиВВоду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВыпускиВВоду</name>
  <comment>В справочнике содержатся сведения о выпусках в воду, используемых предприятием.</comment>
  <attributes>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодныйОбъект</name>
    <type>
      <types>DefinedType.ИсточникиПриемникиВод</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыСевернойШироты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыВосточнойДолготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасстояниеОтУстья</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВодВыпуска</name>
    <type>
      <types>EnumRef.Удалить_ВидВодВодозабораВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКатегорияКачестваВоды</name>
    <type>
      <types>CatalogRef.КатегорииКачестваВоды</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидОчисткиВоды</name>
    <type>
      <types>EnumRef.ВидыОчисткиОтведенныхВод</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМощностьОчистныхСооружений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидСточныхВод</name>
    <type>
      <types>EnumRef.ВидыСточныхВод</types>
    </type>
  </attributes>
  <attributes>
    <name>ДиаметрВыпускногоОтверстия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасстояниеОтМестаВыпускаДоБерега</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасстояниеВыпускногоОтверстияДоПоверхности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаИсточникаПриемника</name>
    <type>
      <types>CatalogRef.КодыТипыИсточниковПриемников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодохозяйственныйУчасток</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЭксплуатации</name>
    <type>
      <types>EnumRef.СостояниеЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРыбохозяйственногоЗначения</name>
    <type>
      <types>EnumRef.КатегорияРыбохозяйственногоЗначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодныйОбъектВЧертеНаселенныхМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодныйОбъектПитьевогоИХозяйственноБытовогоНазначения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтведениеВПодземныйГоризонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПунктыНаблюденияТочкиЗамера</name>
    <attributes>
      <name>НомерСтвора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордСевШир</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордВостДолг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаЗамера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриборыВодоучета</name>
    <attributes>
      <name>ПриборУчетаВоды</name>
      <type>
        <types>CatalogRef.ПриборыУчетаИспользованияВоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДатаПоследнейПоверки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПериодичностьПоверки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииКачестваВоды</name>
    <attributes>
      <name>КатегорияКачества</name>
      <type>
        <types>CatalogRef.КатегорииКачестваВоды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОчистноеСооружение</name>
      <type>
        <types>CatalogRef.ОчистныеСооружения</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВидОчистки</name>
      <type>
        <types>EnumRef.ВидыОчисткиОтведенныхВод</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьМощностьОчистныхСооружений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Catalogs/Водозаборы/Водозаборы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Водозаборы</name>
  <comment>В справочнике содержатся сведения об источниках водозабора предприятия.</comment>
  <attributes>
    <name>ПроектнаяПроизводительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведенияВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭксплуатируетсяВНастоящееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыСевернойШироты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыВосточнойДолготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодныйОбъект</name>
    <type>
      <types>DefinedType.ИсточникиПриемникиВод</types>
    </type>
  </attributes>
  <attributes>
    <name>РасстояниеОтУстья</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияКачестваВоды</name>
    <type>
      <types>CatalogRef.КатегорииКачестваВоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВодВодозабора</name>
    <type>
      <types>EnumRef.Удалить_ВидВодВодозабораВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>МуниципальныйРайон</name>
    <type>
      <types>CatalogRef.ОКТМО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>CatalogRef.ОКАТО</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаИсточникаПриемника</name>
    <type>
      <types>CatalogRef.КодыТипыИсточниковПриемников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодохозяйственныйУчасток</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственностьСтороннейОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПунктыНаблюденияТочкиЗамера</name>
    <attributes>
      <name>НомерСтвора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордСевШир</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордВостДолг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаЗамера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриборыВодоучета</name>
    <attributes>
      <name>ПриборУчетаВоды</name>
      <type>
        <types>CatalogRef.ПриборыУчетаИспользованияВоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Catalogs/ВыпускиВВоду/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// 1. У выпуска не может быть несколько одинаковых категорий качества воды.
	СтруктураПоиска = Новый Структура("КатегорияКачества");
	
	ТаблицаКатегорийКачества = Новый ТаблицаЗначений;
	
	ТаблицаКатегорийКачества.Колонки.Добавить("КатегорияКачества");
	ТаблицаКатегорийКачества.Колонки.Добавить("Количество");
	
	Для Каждого СтрокаКатКачества Из КатегорииКачестваВоды Цикл 
		
		СтрокаТабПроверки = ТаблицаКатегорийКачества.Добавить();
		
		СтрокаТабПроверки.КатегорияКачества = СтрокаКатКачества.КатегорияКачества;
		СтрокаТабПроверки.Количество        = 1;
		
	КонецЦикла; // Для Каждого СтрокаКатКачества Из КатегорииКачестваВоды Цикл 
	
	ТаблицаКатегорийКачества.Свернуть("КатегорияКачества", "Количество");
	
	Ошибки = Неопределено;
	
	Для Каждого СтрокаТабПроверки Из ТаблицаКатегорийКачества Цикл 
		
		Если СтрокаТабПроверки.Количество > 1 Тогда 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В таблице категорий качества вод, категория <" + СтрокаТабПроверки.КатегорияКачества + 
			"> указана несколько раз. Указание одной категории качества несколько раз недопустимо.", ЭтотОбъект, "КатегорииКачестваВоды", , Отказ); 
			
		КонецЕсли; // Если СтрокаТабПроверки.Количество > 1 Тогда
		
	КонецЦикла; // Для Каждого СтрокаТабПроверки Из ТаблицаКатегорийКачества Цикл 
	
	СписокВидовВодныхОбъектовУстье = Справочники.Водозаборы.ПолучитьСписокВидовВодныхОбъектовРасстояниеДоУстья();
	
	Если СписокВидовВодныхОбъектовУстье.Найти(КодТипаИсточникаПриемника) <> Неопределено Тогда 
		ПроверяемыеРеквизиты.Добавить("РасстояниеОтУстья");
	КонецЕсли; // Если СписокВидовВодныхОбъектовУстье.Найти(КодТипаИсточникаВодоснабжения) <> Неопределено Тогда

	
КонецПроцедуры // Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

Процедура ПриЗаписи( Отказ )

// 1СКСУ - Казанцев И.В. 19.01.17 11:15
// При провере АПК не обнаружена конструкция "Если ОбменДанными.Загрузка Тогда ...".
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
// 1СКСУ - Казанцев И.В. 19.01.17 11:15 Конец

	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Ссылка ) Тогда
		Обработки.СозданиеНСИ.ЗапуститьБизнесПроцессСогласования( Ссылка );
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением( Отказ )

// 1СКСУ - Казанцев И.В. 19.01.17 11:15
// При провере АПК не обнаружена конструкция "Если ОбменДанными.Загрузка Тогда ...".
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
// 1СКСУ - Казанцев И.В. 19.01.17 11:15 Конец

	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Ссылка ) Тогда
		Если Не Обработки.СозданиеНСИ.ЭлементДоступенДляРедактирования( Ссылка ) Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
